Update 2026-01-12-QNX-TTY-Technical-Introduction.md
